<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250603201428.png">

| 姓    名： | 李逸滔         |
| ------- | ----------- |
| 学    号： | 20232005117 |
| 班    级： | 23软工3班      |
| 提交日期：   | 2025/6/2    |
```toc
```


## 1.实验目的
（1）了解计算机网络的组成，熟悉局域网的设计理念。

（2）综合运用计算机网络理论知识，设计以及配置一个中型计算机网络。

（3）掌握在实际环境中如何配置及管理路由器和交换机。

（4）提高网络故障排错能力。

（5）提高自己的自学能力以及解决综合性复杂问题的能力。

（6）对本学期学习计算机网络相关知识的一次自我检验。

 ---
## 2.预备问题


 ---
## 3.实验内容
根据实际情况为客户提供中型企业网络解决方案，完成网络的设计、配置、 管理和故障排除，具体包括网络拓扑结构图的设计、VLAN的划分、IP地址的规 划及分配、路由器、交换机等网络设备的配置等内容，涉及计算机网络五层协议 体系结构相关的理论知识和操作技能。

具体任务如下：

1.网络拓扑结构图的设计及绘制

2.VLAN 的划分及地址分配

3.设备网络参数配置

4.设备管理功能配置

5.VLAN间路由

6.DHCP部署与配置

7.路由功能配置

8.网络地址转换的配置

9.网络安全技术配置

10.广域网配置

 ---
## 4.实验步骤和结果
### 4.1网络拓扑图的绘制
#### 4.1.1网络拓扑图
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605120427.png">
#### 4.1.2外网路由器添加串行接口
- 在需要添加Serial串行接口的路由器
	- 关闭电源
	- 将`HWIC-2T` （高密度串口模块），拖到机箱的插槽中
	- 开启电源
- 得到2个Serial 串口，`s0/3/0`、`s0/3/1`
	- 第一个数字（0）：表示路由器的机箱号（如果有多个机箱）
	- 第二个数字（3）：表示第 4 个插槽（slot 3）
	- 第三个数字（0）：表示这个模块上的第 1 个接口（port 0）
- 用 Serial DTE 线连接串口
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250603205303.png">

#### 4.1.3内网访客PC机换成无线网卡
- 在访客PC机
	- 关闭电源（状态变灰）
	- 将插槽中原有的有线网卡拖到左侧栏（移除）
	- 将`WMP300N`（无线网卡）拖入插槽 
	- 开启电源（状态变白）
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604105029.png">
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604105053.png">

 ---
### 4.2VLAN 划分及地址分配
#### 4.2.1.1内网【VLAN、子网划分、端口配置】
- 内网的专用地址选择C类（16位块）：`192.168.0.0/16`，即`192.168.0.0 - 192.168.255.255`
- 按IP子网地址划分，VID与IP地址绑定。【方便按部门或业务划分网络】
- VID按间隔为10分配，方便部门下再细分网段时，VID依然保持有序
- 销售部、技术部、行政部的主机容量设置是根据题目的

| 部门         | VLAN ID | 主机容量 | 子网（专用 IP）        | 默认网关地址（最后可用）   |
| ---------- | ------: | ---: | ---------------- | -------------- |
| 总部销售部      |      10 |  254 | 192.168.10.0 /24 | 192.168.10.254 |
| 总部技术部      |      20 |  254 | 192.168.20.0 /24 | 192.168.20.254 |
| 总部行政部      |      30 |   62 | 192.168.30.0 /26 | 192.168.30.62  |
| 总部服务器      |      40 |   14 | 192.168.40.0 /28 | 192.168.40.14  |
| 总部访客 Wi-Fi |      50 |  254 | 192.168.50.0 /24 | 192.168.50.254 |
| 分部         |      60 |  126 | 192.168.60.0 /25 | 192.168.60.126 |
| 连接NAT      |      70 |    2 | 192.168.70.0/30  | 192.168.70.1   |

| 核心层和NAT                         | 上联接口及对象                        | 下联接口及对象                                                                                                                                                          |
| ------------------------------- | ------------------------------ | ---------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| **3560-24PS Switch4** <br>（核心层） | Fa0/1 → 2911 NAT Router Gig0/0 | Fa0/2 → 3560-24PS Switch5 Fa0/1（销售部汇聚）<br>Fa0/3 → 3560-24PS Switch6 Fa0/1（技术部汇聚）<br>Fa0/4 → 3560-24PS Switch7 Fa0/1（服务器区汇聚）Fa0/5 → 3560-24PS Switch8 Fa0/1（分部汇聚） |
| **2911 NAT Router**             | Gig0/1 → 外网                    | Gig0/0 → 3560-24PS Switch4 Fa0/1                                                                                                                                 |

| 分部设备                             | 上联接口及对象                             | 下联接口及对象                         |
| -------------------------------- | ----------------------------------- | ------------------------------- |
| **PC-PT 技术部-50台PC**              | Fa0 → 2960-24TT Switch5 Fa0/2       | —                               |
| **2960-24TT Switch5** <br>（分部接入） | Fa0/1 → 3560-24PS Switch8 Fa0/2     | Fa0/2 → PC-PT 技术部-50台PC Fa0     |
| **3560-24PS Switch8** <br>（分部汇聚） | Fa0/1 → 核心层 3560-24PS Switch4 Fa0/5 | Fa0/2 → 2960-24TT Switch5 Fa0/1 |

| Switch5及下联设备                       | 上联接口及对象                                   | 下联接口及对象                                                                  |
| ---------------------------------- | ----------------------------------------- | ------------------------------------------------------------------------ |
| **3560-24PS Switch5** <br>（总部汇聚）   | Fa0/1 → 核心层 3560-24PS Switch4 Fa0/2       | Fa0/2 → WRT300N WirelessRouter1 Fa0/0<br>Fa0/3 → 2960-24TT Switch1 Fa0/1 |
| **WRT300N WirelessRouter1** （无线接入） | Fa0/1(Ethernet) → 3560-24PS Switch5 Fa0/2 | 无线 → PC-PT 大厅访客PC                                                        |
| **PC-PT 大厅访客PC**                   | 无线 → WRT300N WirelessRouter1              | —                                                                        |
| **2960-24TT Switch1** <br>（销售部接入）  | Fa0/1 → 3560-24PS Switch5 Fa0/3           | Fa0/2 → PC-PT 销售部-130台PC Fa0                                             |
| **PC-PT 销售部-130台PC**               | Fa0 → 2960-24TT Switch1 Fa0/2             | —                                                                        |

| Switch6及下联设备                      | 上联接口及对象                             | 下联接口及对象                                                            |
| --------------------------------- | ----------------------------------- | ------------------------------------------------------------------ |
| **3560-24PS Switch6** <br>（总部汇聚）  | Fa0/1 → 核心层 3560-24PS Switch4 Fa0/3 | Fa0/2 → 2960-24TT Switch2 Fa0/1<br>Fa0/3 → 2960-24TT Switch3 Fa0/1 |
| **2960-24TT Switch2** <br>（技术部接入） | Fa0/1 → 3560-24PS Switch6 Fa0/2     | Fa0/2 → PC-PT 技术部-200台PC Fa0                                       |
| **PC-PT 技术部-200台PC**              | Fa0 → 2960-24TT Switch2 Fa0/2       | —                                                                  |
| **2960-24TT Switch3** <br>（行政部接入） | Fa0/1 → 3560-24PS Switch6 Fa0/3     | Fa0/2 → PC-PT 行政部-20台PC Fa0                                        |
| **PC-PT 行政部-20台PC**               | Fa0 → 2960-24TT Switch3 Fa0/2       | —                                                                  |

| Switch7及下联设备                       | 上联接口及对象                             | 下联接口及对象                                                      |
| ---------------------------------- | ----------------------------------- | ------------------------------------------------------------ |
| **3560-24PS Switch7** <br>（总部汇聚）   | Fa0/1 → 核心层 3560-24PS Switch4 Fa0/4 | Fa0/2 → 2960-24TT Switch4 Fa0/1                              |
| **2960-24TT Switch4** <br>（服务器区接入） | Fa0/1 → 3560-24PS Switch7 Fa0/2     | Fa0/2 → Server-PT DNS服务器 Fa0<br>Fa0/3 → Server-PT WWW服务器 Fa0 |
| **Server-PT DNS服务器**               | Fa0 → 2960-24TT Switch4 Fa0/2       | —                                                            |
| **Server-PT WWW服务器**               | Fa0 → 2960-24TT Switch4 Fa0/3       | —                                                            |


 ---
#### 4.2.1.2外网【端口配置、PC5配置】
- 根据任务8，将外网的网段设置在`220.1.0.0/24`里面

| NAT Router g0/1【WAN口】 | 220.1.1.1/24 |
| --------------------- | ------------ |
| **Router1接口g0/0**     | 220.1.1.2/24 |
| **Router1接口s0/3/0**   | 220.1.2.1/24 |
| **Router2接口s0/3/0**   | 220.1.2.2/24 |
| **Router1接口s0/3/1**   | 220.1.3.1/24 |
| **Router3接口s0/3/0**   | 220.1.3.2/24 |
| **Router2接口s0/3/1**   | 220.1.4.1/24 |
| **Router4接口s0/3/0**   | 220.1.4.2/24 |
| **Router3接口s0/3/1**   | 220.1.5.1/24 |
| **Router4接口s0/3/1**   | 220.1.5.2/24 |
| **Router4接口g0/0**     | 220.1.6.1/24 |

| 设备名称           | 上联接口及对象                                                | 下联接口及对象                                                |
| -------------- | ------------------------------------------------------ | ------------------------------------------------------ |
| **NAT Router** | Gig0/1 → Router1 Gig0/0                                | Gig0/0 → LAN                                           |
| **Router1**    | Gig0/0 → NAT Router Gig0/1<br>                         | Se0/3/0 → Router2 Se0/3/0<br>Se0/3/1 → Router3 Se0/3/0 |
| **Router2**    | Se0/3/0 → Router1 Se0/3/0<br>                          | Se0/3/1 → Router4 Se0/3/0                              |
| **Router3**    | Se0/3/0 → Router1 Se0/3/1                              | Se0/3/1 → Router4 Se0/3/1                              |
| **Router4**    | Se0/3/0 → Router2 Se0/3/1<br>Se0/3/1 → Router3 Se0/3/1 | Gig0/0 → PC5 Fa0                                       |
| **PC5**        | Fa0 → Router4 Gig0/0                                   | —                                                      |

- PC5
	- PC5 Fa0 : IP 220.1.6.2 掩码 255.255.255.0 ，默认网关 220.1.6.1，DNS Server 220.2.6.1
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250603214816.png">

 ---
### 4.3设备网络参数的配置
#### 4.3.1.1内网各终端 & 服务器配置IP
| 设备                      | 端口                  | IP / 掩码          | 默认网关           |
| ----------------------- | ------------------- | ---------------- | -------------- |
| PC-销售部                  | Fa0                 | 192.168.10.1 /24 | 192.168.10.254 |
| PC-技术部                  | Fa0                 | 192.168.20.1 /24 | 192.168.20.254 |
| PC-行政部                  | Fa0                 | 192.168.30.1 /26 | 192.168.30.62  |
| 访客 PC（无线）               | 无线                  | 192.168.50.1 /24 | 192.168.50.254 |
| PC-分部                   | Fa0                 | 192.168.60.1 /25 | 192.168.60.126 |
| DNS Server              | Fa0                 | 192.168.40.1 /28 | 192.168.40.14  |
| WWW Server              | Fa0                 | 192.168.40.2 /28 | 192.168.40.14  |
| WRT300N WirelessRouter1 | Fa0/1<br>(Ethernet) | 192.168.50.2 /24 | —              |
| NAT Router Gig0/0       | Gig0/0              | 192.168.70.2 /30 | —              |
- 各个部门PC机、服务器配置类似<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604113257.png">

- WRT300N WirelessRouter1的配置
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604114134.png">

- NAT路由器配置
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604115909.png">

 ---
#### 4.3.1.2内网各交换机端口配置
- MSW4（原 3560-24PS Switch4）— 核心层三层交换机
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604121530.png" width="475">
```
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW4

! === 创建 VLAN 并命名 ===
MSW4(config)# vlan 10
MSW4(config-vlan)#  name SALES
MSW4(config-vlan)# exit
MSW4(config)# vlan 20
MSW4(config-vlan)#  name ENGINEERING
MSW4(config-vlan)# exit
MSW4(config)# vlan 30
MSW4(config-vlan)#  name ADMIN
MSW4(config-vlan)# exit
MSW4(config)# vlan 40
MSW4(config-vlan)#  name SERVERS
MSW4(config-vlan)# exit
MSW4(config)# vlan 50
MSW4(config-vlan)#  name GUEST_WIFI
MSW4(config-vlan)# exit
MSW4(config)# vlan 60
MSW4(config-vlan)#  name BRANCH
MSW4(config-vlan)# exit
MSW4(config)# vlan 70
MSW4(config-vlan)#  name NAT_LINK
MSW4(config-vlan)# exit

! === 三层网关接口 ===
MSW4(config)# interface vlan 10
MSW4(config-if)#  ip address 192.168.10.254 255.255.255.0
MSW4(config-if)#  no shutdown
MSW4(config-if)# exit
MSW4(config)# interface vlan 20
MSW4(config-if)#  ip address 192.168.20.254 255.255.255.0
MSW4(config-if)#  no shutdown
MSW4(config-if)# exit
MSW4(config)# interface vlan 30
MSW4(config-if)#  ip address 192.168.30.62 255.255.255.192
MSW4(config-if)#  no shutdown
MSW4(config-if)# exit
MSW4(config)# interface vlan 40
MSW4(config-if)#  ip address 192.168.40.14 255.255.255.240
MSW4(config-if)#  no shutdown
MSW4(config-if)# exit
MSW4(config)# interface vlan 50
MSW4(config-if)#  ip address 192.168.50.254 255.255.255.0
MSW4(config-if)#  no shutdown
MSW4(config-if)# exit
MSW4(config)# interface vlan 60
MSW4(config-if)#  ip address 192.168.60.126 255.255.255.128
MSW4(config-if)#  no shutdown
MSW4(config-if)# exit
MSW4(config)# interface vlan 70
MSW4(config-if)#  ip address 192.168.70.1 255.255.255.252
MSW4(config-if)#  no shutdown
MSW4(config-if)# exit

! === 打开三层转发 ===
MSW4(config)# ip routing

! === Fa0/1 作为 NAT 链路的 Access 口 ===
MSW4(config)# interface fastEthernet0/1
MSW4(config-if)#  switchport mode access
MSW4(config-if)#  switchport access vlan 70
MSW4(config-if)#  no shutdown
MSW4(config-if)# exit

! === Fa0/2-Fa0/5 作为下行汇聚链路 Trunk ===
MSW4(config)# interface range fastEthernet0/2 - 5
MSW4(config-if-range)# switchport trunk encapsulation dot1q
MSW4(config-if-range)# switchport mode trunk
MSW4(config-if-range)# switchport trunk allowed vlan 10,20,30,40,50,60,70
MSW4(config-if-range)# no shutdown
MSW4(config-if-range)# exit

MSW4(config)# end
MSW4# write memory
```


- MSW5（原 3560-24PS Switch5）— 销售部 / 访客 Wi-Fi 汇聚
```
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW5

! === 逐条创建 VLAN ===
MSW5(config)# vlan 10
MSW5(config-vlan)# exit
MSW5(config)# vlan 20
MSW5(config-vlan)# exit
MSW5(config)# vlan 30
MSW5(config-vlan)# exit
MSW5(config)# vlan 40
MSW5(config-vlan)# exit
MSW5(config)# vlan 50
MSW5(config-vlan)# exit
MSW5(config)# vlan 60
MSW5(config-vlan)# exit
MSW5(config)# vlan 70
MSW5(config-vlan)# exit

! === Fa0/1：上行到核心 MSW4（Trunk）===
MSW5(config)# interface fastEthernet0/1
MSW5(config-if)# switchport trunk encapsulation dot1q
MSW5(config-if)# switchport mode trunk
MSW5(config-if)# switchport trunk allowed vlan 10,20,30,40,50,60,70
MSW5(config-if)# no shutdown
MSW5(config-if)# exit

! === Fa0/2：直连 WRT300N 无线 AP（访客 Wi-Fi，Access VLAN50）===
MSW5(config)# interface fastEthernet0/2
MSW5(config-if)# switchport mode access
MSW5(config-if)# switchport access vlan 50
MSW5(config-if)# spanning-tree portfast
MSW5(config-if)# no shutdown
MSW5(config-if)# exit

! === Fa0/3：下行到接入交换机 SW1（Trunk，仅允许销售 VLAN10）===
MSW5(config)# interface fastEthernet0/3
MSW5(config-if)# switchport trunk encapsulation dot1q
MSW5(config-if)# switchport mode trunk
MSW5(config-if)# switchport trunk allowed vlan 10
MSW5(config-if)# no shutdown
MSW5(config-if)# exit

MSW5(config)# end
MSW5# write memory
```

- MSW6（汇聚层交换机，技术部/行政部汇聚）
```
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW6

! === 逐条创建 VLAN ===
MSW6(config)# vlan 10
MSW6(config-vlan)# exit
MSW6(config)# vlan 20
MSW6(config-vlan)# exit
MSW6(config)# vlan 30
MSW6(config-vlan)# exit
MSW6(config)# vlan 40
MSW6(config-vlan)# exit
MSW6(config)# vlan 50
MSW6(config-vlan)# exit
MSW6(config)# vlan 60
MSW6(config-vlan)# exit
MSW6(config)# vlan 70
MSW6(config-vlan)# exit

! === Fa0/1：上行至核心 MSW4（Trunk）===
MSW6(config)# interface fastEthernet0/1
MSW6(config-if)# description Uplink to MSW4 Fa0/3
MSW6(config-if)# switchport trunk encapsulation dot1q
MSW6(config-if)# switchport mode trunk
MSW6(config-if)# switchport trunk allowed vlan 10,20,30,40,50,60,70
MSW6(config-if)# no shutdown
MSW6(config-if)# exit

! === Fa0/2：下行至技术部接入交换机 SW2（Engineering，Trunk）===
MSW6(config)# interface fastEthernet0/2
MSW6(config-if)# description Downlink to SW2 Fa0/1 (Engineering)
MSW6(config-if)# switchport trunk encapsulation dot1q
MSW6(config-if)# switchport mode trunk
MSW6(config-if)# switchport trunk allowed vlan 20
MSW6(config-if)# no shutdown
MSW6(config-if)# exit

! === Fa0/3：下行至行政部接入交换机 SW3（Admin，Trunk）===
MSW6(config)# interface fastEthernet0/3
MSW6(config-if)# description Downlink to SW3 Fa0/1 (Admin)
MSW6(config-if)# switchport trunk encapsulation dot1q
MSW6(config-if)# switchport mode trunk
MSW6(config-if)# switchport trunk allowed vlan 30
MSW6(config-if)# no shutdown
MSW6(config-if)# exit

MSW6(config)# end
MSW6# write memory
```

- MSW7（汇聚层交换机，服务器区汇聚）
```
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW7

! === 逐条创建 VLAN ===
MSW7(config)# vlan 10
MSW7(config-vlan)# exit
MSW7(config)# vlan 20
MSW7(config-vlan)# exit
MSW7(config)# vlan 30
MSW7(config-vlan)# exit
MSW7(config)# vlan 40
MSW7(config-vlan)# exit
MSW7(config)# vlan 50
MSW7(config-vlan)# exit
MSW7(config)# vlan 60
MSW7(config-vlan)# exit
MSW7(config)# vlan 70
MSW7(config-vlan)# exit

! === Fa0/1：上行至核心 MSW4（Trunk）===
MSW7(config)# interface fastEthernet0/1
MSW7(config-if)# switchport trunk encapsulation dot1q
MSW7(config-if)# switchport mode trunk
MSW7(config-if)# switchport trunk allowed vlan 10,20,30,40,50,60,70
MSW7(config-if)# no shutdown
MSW7(config-if)# exit

! === Fa0/2：下行至服务器接入交换机 SW4（Servers，Trunk）===
MSW7(config)# interface fastEthernet0/2
MSW7(config-if)# switchport trunk encapsulation dot1q
MSW7(config-if)# switchport mode trunk
MSW7(config-if)# switchport trunk allowed vlan 40
MSW7(config-if)# no shutdown
MSW7(config-if)# exit

MSW7(config)# end
MSW7# write memory
```


- MSW8（汇聚层交换机，分部汇聚）
```
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW8

! === 逐条创建 VLAN ===
MSW8(config)# vlan 10
MSW8(config-vlan)# exit
MSW8(config)# vlan 20
MSW8(config-vlan)# exit
MSW8(config)# vlan 30
MSW8(config-vlan)# exit
MSW8(config)# vlan 40
MSW8(config-vlan)# exit
MSW8(config)# vlan 50
MSW8(config-vlan)# exit
MSW8(config)# vlan 60
MSW8(config-vlan)# exit
MSW8(config)# vlan 70
MSW8(config-vlan)# exit

! === Fa0/1：上行至核心 MSW4（Trunk）===
MSW8(config)# interface fastEthernet0/1
MSW8(config-if)# switchport trunk encapsulation dot1q
MSW8(config-if)# switchport mode trunk
MSW8(config-if)# switchport trunk allowed vlan 10,20,30,40,50,60,70
MSW8(config-if)# no shutdown
MSW8(config-if)# exit

! === Fa0/2：下行至分部接入交换机 SW5（Branch，Trunk）===
MSW8(config)# interface fastEthernet0/2
MSW8(config-if)# switchport trunk encapsulation dot1q
MSW8(config-if)# switchport mode trunk
MSW8(config-if)# switchport trunk allowed vlan 60
MSW8(config-if)# no shutdown
MSW8(config-if)# exit

MSW8(config)# end
MSW8# write memory
```

- SW2（技术部接入）
```
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW2

! === 创建 VLAN 20（技术部） ===
SW2(config)# vlan 20
SW2(config-vlan)# exit

! === Fa0/1：上行到 MSW6 Fa0/2（Trunk，只允许 VLAN20） ===
SW2(config)# interface fastEthernet0/1
SW2(config-if)# switchport mode trunk
SW2(config-if)# switchport trunk allowed vlan 20
SW2(config-if)# no shutdown
SW2(config-if)# exit

! === Fa0/2：连接 PC-技术部（Access，VLAN20） ===
SW2(config)# interface fastEthernet0/2
SW2(config-if)# switchport mode access
SW2(config-if)# switchport access vlan 20
SW2(config-if)# spanning-tree portfast
SW2(config-if)# no shutdown
SW2(config-if)# exit

SW2(config)# end
SW2# write memory
```

- SW3（行政部接入）
```
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW3

! === 创建 VLAN 30（行政部） ===
SW3(config)# vlan 30
SW3(config-vlan)# exit

! === Fa0/1：上行到 MSW6 Fa0/3（Trunk，只允许 VLAN30） ===
SW3(config)# interface fastEthernet0/1
SW3(config-if)# switchport mode trunk
SW3(config-if)# switchport trunk allowed vlan 30
SW3(config-if)# no shutdown
SW3(config-if)# exit

! === Fa0/2：连接 PC-行政部（Access，VLAN30） ===
SW3(config)# interface fastEthernet0/2
SW3(config-if)# switchport mode access
SW3(config-if)# switchport access vlan 30
SW3(config-if)# spanning-tree portfast
SW3(config-if)# no shutdown
SW3(config-if)# exit

SW3(config)# end
SW3# write memory
```

- SW4（服务器区接入）
```
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW4

! === 创建 VLAN 40（服务器区） ===
SW4(config)# vlan 40
SW4(config-vlan)# exit

! === Fa0/1：上行到 MSW7 Fa0/2（Trunk，只允许 VLAN40） ===
SW4(config)# interface fastEthernet0/1
SW4(config-if)# description Uplink to MSW7 Fa0/2
SW4(config-if)# switchport mode trunk
SW4(config-if)# switchport trunk allowed vlan 40
SW4(config-if)# no shutdown
SW4(config-if)# exit

! === Fa0/2：连接 DNS Server（Access，VLAN40） ===
SW4(config)# interface fastEthernet0/2
SW4(config-if)# description DNS-SERVER
SW4(config-if)# switchport mode access
SW4(config-if)# switchport access vlan 40
SW4(config-if)# spanning-tree portfast
SW4(config-if)# no shutdown
SW4(config-if)# exit

! === Fa0/3：连接 WWW Server（Access，VLAN40） ===
SW4(config)# interface fastEthernet0/3
SW4(config-if)# description WWW-SERVER
SW4(config-if)# switchport mode access
SW4(config-if)# switchport access vlan 40
SW4(config-if)# spanning-tree portfast
SW4(config-if)# no shutdown
SW4(config-if)# exit

SW4(config)# end
SW4# write memory
```

- SW5（分部接入）
```
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW5

! === 创建 VLAN 60（分部） ===
SW5(config)# vlan 60
SW5(config-vlan)# exit

! === Fa0/1：上行到 MSW8 Fa0/2（Trunk，只允许 VLAN60） ===
SW5(config)# interface fastEthernet0/1
SW5(config-if)# description Uplink to MSW8 Fa0/2
SW5(config-if)# switchport mode trunk
SW5(config-if)# switchport trunk allowed vlan 60
SW5(config-if)# no shutdown
SW5(config-if)# exit

! === Fa0/2：连接 PC-分部（Access，VLAN60） ===
SW5(config)# interface fastEthernet0/2
SW5(config-if)# description PC-BRANCH
SW5(config-if)# switchport mode access
SW5(config-if)# switchport access vlan 60
SW5(config-if)# spanning-tree portfast
SW5(config-if)# no shutdown
SW5(config-if)# exit

SW5(config)# end
SW5# write memory
```
 ---
#### 4.3.1.3外网各路由器端口配置
- Router1
```
!— 与 NAT Router 相连的 WAN 口 —
Router1(config)# interface GigabitEthernet0/0
Router1(config-if)# ip address 220.1.1.2 255.255.255.0
Router1(config-if)# no shutdown
Router1(config-if)# exit

!— 与 Router2 相连的 Serial0/3/0 —
Router1(config)# interface Serial0/3/0
Router1(config-if)# ip address 220.1.2.1 255.255.255.0
Router1(config-if)# encapsulation ppp     
Router1(config-if)# clock rate 64000       
Router1(config-if)# no shutdown
Router1(config-if)# exit

!— 与 Router3 相连的 Serial0/3/1 —
Router1(config)# interface Serial0/3/1
Router1(config-if)# ip address 220.1.3.1 255.255.255.0
Router1(config-if)# encapsulation ppp
Router1(config-if)# no shutdown
Router1(config-if)# exit
```

- Router2
```
!— 与 Router1 相连 —
Router2(config)# interface Serial0/3/0
Router2(config-if)# ip address 220.1.2.2 255.255.255.0
Router2(config-if)# encapsulation ppp
Router2(config-if)# no shutdown
Router2(config-if)# exit

!— 与 Router4 相连 —
Router2(config)# interface Serial0/3/1
Router2(config-if)# ip address 220.1.4.1 255.255.255.0
Router2(config-if)# encapsulation ppp
Router2(config-if)# no shutdown
Router2(config-if)# exit
```

- Router3
```
!— 与 Router1 相连 —
Router3(config)# interface Serial0/3/0
Router3(config-if)# ip address 220.1.3.2 255.255.255.0
Router3(config-if)# encapsulation ppp
Router3(config-if)# no shutdown
Router3(config-if)# exit

!— 与 Router4 相连 —
Router3(config)# interface Serial0/3/1
Router3(config-if)# ip address 220.1.5.1 255.255.255.0
Router3(config-if)# encapsulation ppp
Router3(config-if)# no shutdown
Router3(config-if)# exit
```

- Router4
```
!— 与 Router2 相连 —
Router4(config)# interface Serial0/3/0
Router4(config-if)# ip address 220.1.4.2 255.255.255.0
Router4(config-if)# encapsulation ppp
Router4(config-if)# no shutdown
Router4(config-if)# exit

!— 与 Router3 相连 —
Router4(config)# interface Serial0/3/1
Router4(config-if)# ip address 220.1.5.2 255.255.255.0
Router4(config-if)# encapsulation ppp
Router4(config-if)# no shutdown
Router4(config-if)# exit

!— 与 PC5 相连 —
Router4(config)# interface GigabitEthernet0/0
Router4(config-if)# ip address 220.1.6.1 255.255.255.0
Router4(config-if)# no shutdown
Router4(config-if)# exit
```

 ---
#### 4.3.2DNS服务器添加记录
- 点击 **“Services”** 选项卡
- 点击 **“DNS”**
- 将“DNS Service ”设置为ON
- 添加记录
	- “Name” 填入 `cisco.com`
	- “Address” 填入你的 WWW 服务器地址`192.168.40.2`
	- 点击“Add”，下方就会出现条目
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604131832.png">


 ---
#### 4.3.3.1DNS、WWW服务器配置
- <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604131340.png" width="375">
- <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604131401.png" width="375">
- 确保 **HTTP 服务**启用
  <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604131500.png">
#### 4.3.3.1在一台PC==验证==DNS解析生效
- 在销售部PC，“DNS Server”填入`192.168.40.1`
  <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604132146.png" width="350">

- 在销售部PC，ping cisco.com
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604132311.png">

- 在销售部PC，用Web Browser访问cisco.com
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604132423.png">
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604132527.png">


 ---
#### 4.3.4.1配置无线路由器
- 配置网络名为SOAI：点击Wireless→Basic Settings
	- 配置好，下滑，点击“Save”
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604140251.png">

- 配置安全模式、加密算法、密钥：点击Wireless→Wireless Security
	- 配置好，下滑，点击“Save”
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604140519.png">


#### 4.3.4.2配置大厅访客PC并测试
- 配置访客 PC 的无线网卡
	- 点击“PC Wireless”应用
	- 点击“Connect”选项卡，选中SOAI条目，点击connect
	- 在弹窗填入密钥，点击connect
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604141552.png" width="325">
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604141725.png" width="350"><img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604141916.png" width="350">

- 测试对销售部PC的连通
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604142154.png" width="350">

 ---
### 4.4设备管理功能的配置
#### 4.4.1为MSW4配置Console，VTY，enable密码
```
!--设置加密的 enable 密码
MSW4(config)# enable secret en111

!--配置 Console 口登录密码
MSW4(config)# line console 0
MSW4(config-line)# password con111
MSW4(config-line)# login

!--配置 VTY 口登录密码
MSW4(config)# line vty 0 15
MSW4(config-line)# password vty111
MSW4(config-line)# login
```

- **==验证==**：登录Console口，进入特权模式
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605113326.png" width="400"><img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605113346.png" width="200">


#### 4.4.2为MSW5/6/7配置Console，VTY，enable密码
- 其他交换机配置同理
```
!--设置加密的 enable 密码
MSW5(config)# enable secret en222

!--配置 Console 口登录密码
MSW5(config)# line console 0
MSW5(config-line)# password con222
MSW5(config-line)# login

!--配置 VTY 口登录密码
MSW5(config)# line vty 0 15
MSW5(config-line)# password vty222
MSW5(config-line)# login
```

- **==验证==**：同MSW4

 ---
### 4.5VLAN 间路由
- 在各个部门的主机上ping默认网关，**==验证==**内部连通性
	- 只演示销售部PC，其他同理
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604130105.png" width="400">


- 在各个部门的主机上相互ping，**==验证==**跨VLAN连通性
	- 只演示销售部PC，其他同理
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604130303.png" width="350"><img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604130324.png" width="350">

 ---
### 4.6DHCP 部署与配置

#### 4.6.1创建VLAN 10/20/30 的 SVI
```
!— 为 VLAN 10 创建 SVI，IP 任意选在排除地址范围内（如 192.168.10.253）
MSW5(config)# interface vlan 10
MSW5(config-if)# ip address 192.168.10.253 255.255.255.0
MSW5(config-if)# no shutdown
```

```
!— 为 VLAN 20 创建 SVI，IP 任意选在排除地址范围内（如 192.168.20.253）
MSW6(config)# interface vlan 20
MSW6(config-if)# ip address 192.168.20.253 255.255.255.0
MSW6(config-if)# no shutdown
MSW6(config-if)# exit

!— 为 VLAN 30 创建 SVI，IP 任意选在排除地址范围内（如 192.168.30.61）
MSW6(config)# interface vlan 30
MSW6(config-if)# ip address 192.168.30.61 255.255.255.192
MSW6(config-if)# no shutdown
MSW6(config-if)# exit

MSW6(config)# exit
MSW6# wri

```


#### 4.6.2排除最后4个可用 IP、创建DHCP 池
- 配置MSW5（销售部 VLAN 10）- MSW6（技术部 VLAN 20 + 行政部 VLAN 30）
```
!— 排除销售部最后 4 个可用 IP
MSW5(config)# ip dhcp excluded-address 192.168.10.251 192.168.10.254

!— 创建销售部 DHCP 池
MSW5(config)# ip dhcp pool SALES
MSW5(dhcp-config)# network 192.168.10.0 255.255.255.0
MSW5(dhcp-config)# default-router 192.168.10.254
MSW5(dhcp-config)# dns-server 192.168.40.1
MSW5(dhcp-config)# exit

MSW5(config)# exit
MSW5# write memory
```

- MSW6（技术部 VLAN 20 + 行政部 VLAN 30）
```
!— 排除技术部子网最后 4 个可用 IP
MSW6(config)# ip dhcp excluded-address 192.168.20.251 192.168.20.254

!— 排除行政部子网最后 4 个可用 IP
MSW6(config)# ip dhcp excluded-address 192.168.30.59 192.168.30.62

!— 创建技术部 DHCP 池
MSW6(config)# ip dhcp pool ENGINEERING
MSW6(dhcp-config)# network 192.168.20.0 255.255.255.0
MSW6(dhcp-config)# default-router 192.168.20.254
MSW6(dhcp-config)# dns-server 192.168.40.1
MSW6(dhcp-config)# exit

!— 创建行政部 DHCP 池
MSW6(config)# ip dhcp pool ADMIN
MSW6(dhcp-config)# network 192.168.30.0 255.255.255.192
MSW6(dhcp-config)# default-router 192.168.30.62
MSW6(dhcp-config)# dns-server 192.168.40.1
MSW6(dhcp-config)# exit

MSW6(config)# exit
MSW6# write memory
```

#### 4.6.3在 MSW5 、销售部PC上==验证==
- 在销售部PC上，将 Static 改成 DHCP，等待几秒，PC 通过 DHCP 成功获取到 IP（192.168.10.1）、子网掩码（255.255.255.0）和默认网关（192.168.10.254）
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604151430.png">
- 在 MSW5 上，检查 VLAN 10 SVI 状态
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604152234.png">

- 在 MSW5 上，查看 SALES 池的分配情况
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604152447.png">

- 在 MSW5 上，查看 SALES 池的租约记录
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604150456.png">



- ==技术部、行政部的验证同理==

 ---
### 4.7路由功能配置
#### 4.7.1.1内网启用静态路由、默认静态路由
- 在 MSW4（核心三层交换机）上，添加“默认静态路由”
```
MSW4(config)# ip routing
MSW4(config)# ip route 0.0.0.0 0.0.0.0 192.168.70.2
MSW4(config)# end
MSW4# write memory
```

- 在 NAT Router（2911 NAT Router）上，添加“静态路由”
```
NAT-Router(config)# interface GigabitEthernet0/0
NAT-Router(config-if)# ip address 192.168.70.2 255.255.255.252
NAT-Router(config-if)# no shutdown
NAT-Router(config-if)# exit

NAT-Router(config)# interface GigabitEthernet0/1
NAT-Router(config-if)# ip address 220.1.1.1 255.255.255.0
NAT-Router(config-if)# no shutdown
NAT-Router(config-if)# exit

! — 汇向内部所有网段的静态路由 —
NAT-Router(config)# ip route 192.168.0.0 255.255.0.0 192.168.70.1

! — 指向外网其他路由器的静态路由 —
NAT-Router(config)# ip route 0.0.0.0 0.0.0.0 220.1.1.2

NAT-Router(config)# end
NAT-Router# write memory
```

#### 4.7.1.2外网启用静态路由、默认静态路由
- 在 Router1 上，添加“静态路由”
```
Router1(config)# 
!— 到 220.1.4.0/24（Router2→Router4→220.1.6.0），下一跳 220.1.2.2（Router2） —
Router1(config)# ip route 220.1.4.0 255.255.255.0 220.1.2.2

!— 到 220.1.5.0/24（Router3→Router4→220.1.6.0），下一跳 220.1.3.2（Router3） —
Router1(config)# ip route 220.1.5.0 255.255.255.0 220.1.3.2

!— 到 220.1.6.0/24（最终到 PC5），我这里选择走 Router2→Router4 —
Router1(config)# ip route 220.1.6.0 255.255.255.0 220.1.2.2
```

- 在 Router2 上，添加“静态路由”
```
Router2(config)# 
!— 到 220.1.1.0/24（Router1），下一跳 220.1.2.1 —
ip route 220.1.1.0 255.255.255.0 220.1.2.1

!— 到 220.1.3.0/24（Router3），下一跳也先回给 Router1 —
ip route 220.1.3.0 255.255.255.0 220.1.2.1

!— 到 220.1.5.0/24（Router4 的另一链路），先发给 Router1 再由 Router1→Router3→Router4 —
ip route 220.1.5.0 255.255.255.0 220.1.2.1

!— 到 220.1.6.0/24（PC5 所在网段），可直接下一跳 220.1.4.2 (Router4) —
ip route 220.1.6.0 255.255.255.0 220.1.4.2

!— 配置一条缺省路由，经 Router1 让剩余未知全部回去 —
! ip route 0.0.0.0 0.0.0.0 220.1.2.1

!— 去往内部 192.168.0.0/16 → 下一跳 220.1.1.1（NAT Router） —
ip route 192.168.0.0 255.255.0.0 220.1.1.1
```

- 在 Router3 上，添加“静态路由”
```
Router3(config)# 
!— 到 220.1.1.0/24（Router1），下一跳 220.1.3.1 —
ip route 220.1.1.0 255.255.255.0 220.1.3.1

!— 到 220.1.2.0/24（Router2），送回 Router1 —
ip route 220.1.2.0 255.255.255.0 220.1.3.1

!— 到 220.1.4.0/24（Router4 另一链路），送回 Router1 再到 Router2 —
ip route 220.1.4.0 255.255.255.0 220.1.3.1

!— 到 220.1.6.0/24（PC5），下一跳 220.1.5.2（Router4） —
ip route 220.1.6.0 255.255.255.0 220.1.5.2

!— 配置一条缺省路由，经 Router1 让剩余未知全部回去 —
! ip route 0.0.0.0 0.0.0.0 220.1.3.1
```

- 在 Router4 上，添加“静态路由”
```
Router4(config)#
!— 到 220.1.1.0/24（Router1）和 220.1.2.0/24（Router2），可下一跳 220.1.4.1（Router2）—
ip route 220.1.1.0 255.255.255.0 220.1.4.1
ip route 220.1.2.0 255.255.255.0 220.1.4.1

!— 到 220.1.3.0/24（Router3），下一跳 220.1.5.1 —
ip route 220.1.3.0 255.255.255.0 220.1.5.1

!— 配置一条缺省路由，经 Router2 让剩余未知全部回去 —
! ip route 0.0.0.0 0.0.0.0 220.1.4.1
```

#### 4.7.1.3内外网连通==验证==
- `ping 220.1.1.1`（NAT Router 外网口） → 通。
- `ping 220.1.6.1`（默认网关 Router4） → 通。
- `ping 192.168.70.2`（NAT Router 内网口） → 通。
- `ping 192.168.10.254`（MSW4 在 VLAN10 的 SVI） → 通。
- `ping 192.168.10/20/30/40/50/60.1`（任意内网主机）→ 通。
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604170416.png" width="350"><img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604170522.png" width="350">


 ---
#### 4.7.2.1外网4台路由器 OSPF 协议配置
- Router1 上的 OSPF 配置
```
!---- 删除静态路由 ----
Router1(config)# no ip route 220.1.4.0 255.255.255.0 220.1.2.2
Router1(config)# no ip route 220.1.5.0 255.255.255.0 220.1.3.2
Router1(config)# no ip route 220.1.6.0 255.255.255.0 220.1.2.2

!---- 启动 OSPF 进程 1，并将所有“要互相学习的网络”都纳入 area 0 ----
Router1(config)# router ospf 1
Router1(config-router)# network 220.1.1.0 0.0.0.255 area 0
Router1(config-router)# network 220.1.2.0 0.0.0.255 area 0
Router1(config-router)# network 220.1.3.0 0.0.0.255 area 0
Router1(config-router)# network 220.1.4.0 0.0.0.255 area 0
Router1(config-router)# network 220.1.5.0 0.0.0.255 area 0
Router1(config-router)# network 220.1.6.0 0.0.0.255 area 0
Router1(config-router)# exit

!---- 在各个 OSPF 接口上开启 MD5 验证，密钥编号取 1，密码为 ad ----
Router1(config)# interface GigabitEthernet0/0
Router1(config-if)# ip ospf authentication message-digest
Router1(config-if)# ip ospf message-digest-key 1 md5 ad
Router1(config-if)# exit

Router1(config)# interface Serial0/3/0
Router1(config-if)# ip ospf authentication message-digest
Router1(config-if)# ip ospf message-digest-key 1 md5 ad
Router1(config-if)# exit

Router1(config)# interface Serial0/3/1
Router1(config-if)# ip ospf authentication message-digest
Router1(config-if)# ip ospf message-digest-key 1 md5 ad
Router1(config-if)# exit

Router1(config)# end
Router1# write memory
```

- Router2 上的 OSPF 配置
```
!---- 删除静态路由 ----
Router2(config)# no ip route 220.1.1.0 255.255.255.0 220.1.2.1
Router2(config)# no ip route 220.1.3.0 255.255.255.0 220.1.2.1
Router2(config)# no ip route 220.1.5.0 255.255.255.0 220.1.2.1
Router2(config)# no ip route 220.1.6.0 255.255.255.0 220.1.4.2

!---- 启动 OSPF 进程 1，并将所有“要互相学习的网络”都纳入 area 0 ----
Router2(config)# router ospf 1
Router2(config-router)# network 220.1.1.0 0.0.0.255 area 0
Router2(config-router)# network 220.1.2.0 0.0.0.255 area 0
Router2(config-router)# network 220.1.3.0 0.0.0.255 area 0
Router2(config-router)# network 220.1.4.0 0.0.0.255 area 0
Router2(config-router)# network 220.1.5.0 0.0.0.255 area 0
Router2(config-router)# network 220.1.6.0 0.0.0.255 area 0
Router2(config-router)# exit

!---- 在两个 OSPF 接口上开启 MD5 验证 ----
Router2(config)# interface Serial0/3/0
Router2(config-if)# ip ospf authentication message-digest
Router2(config-if)# ip ospf message-digest-key 1 md5 ad
Router2(config-if)# exit

Router2(config)# interface Serial0/3/1
Router2(config-if)# ip ospf authentication message-digest
Router2(config-if)# ip ospf message-digest-key 1 md5 ad
Router2(config-if)# exit

Router2(config)# end
Router2# write memory
```

- Router3 上的 OSPF 配置
```
!---- 删除静态路由 ----
Router3(config)# no ip route 220.1.1.0 255.255.255.0 220.1.3.1
Router3(config)# no ip route 220.1.2.0 255.255.255.0 220.1.3.1
Router3(config)# no ip route 220.1.4.0 255.255.255.0 220.1.3.1
Router3(config)# no ip route 220.1.6.0 255.255.255.0 220.1.5.2

!---- 启动 OSPF 进程 1，并将所有“要互相学习的网络”都纳入 area 0 ----
Router3(config)# router ospf 1
Router3(config-router)# network 220.1.1.0 0.0.0.255 area 0
Router3(config-router)# network 220.1.2.0 0.0.0.255 area 0
Router3(config-router)# network 220.1.3.0 0.0.0.255 area 0
Router3(config-router)# network 220.1.4.0 0.0.0.255 area 0
Router3(config-router)# network 220.1.5.0 0.0.0.255 area 0
Router3(config-router)# network 220.1.6.0 0.0.0.255 area 0
Router3(config-router)# exit

!---- 在两个 OSPF 接口上开启 MD5 验证 ----
Router3(config)# interface Serial0/3/0
Router3(config-if)# ip ospf authentication message-digest
Router3(config-if)# ip ospf message-digest-key 1 md5 ad
Router3(config-if)# exit

Router3(config)# interface Serial0/3/1
Router3(config-if)# ip ospf authentication message-digest
Router3(config-if)# ip ospf message-digest-key 1 md5 ad
Router3(config-if)# exit

Router3(config)# end
Router3# write memory
```

- Router4 上的 OSPF 配置
```
!---- 删除静态路由 ----
Router4(config)# no ip route 220.1.1.0 255.255.255.0 220.1.4.1
Router4(config)# no ip route 220.1.2.0 255.255.255.0 220.1.4.1
Router4(config)# no ip route 220.1.3.0 255.255.255.0 220.1.5.1

!---- 启动 OSPF 进程 1，并将所有“要互相学习的网络”都纳入 area 0 ----
Router4(config)# router ospf 1
Router4(config-router)# network 220.1.1.0 0.0.0.255 area 0
Router4(config-router)# network 220.1.2.0 0.0.0.255 area 0
Router4(config-router)# network 220.1.3.0 0.0.0.255 area 0
Router4(config-router)# network 220.1.4.0 0.0.0.255 area 0
Router4(config-router)# network 220.1.5.0 0.0.0.255 area 0
Router4(config-router)# network 220.1.6.0 0.0.0.255 area 0
Router4(config-router)# exit

!---- 在三个 OSPF 接口上开启 MD5 验证 ----
Router4(config)# interface Serial0/3/0
Router4(config-if)# ip ospf authentication message-digest
Router4(config-if)# ip ospf message-digest-key 1 md5 ad
Router4(config-if)# exit

Router4(config)# interface Serial0/3/1
Router4(config-if)# ip ospf authentication message-digest
Router4(config-if)# ip ospf message-digest-key 1 md5 ad
Router4(config-if)# exit

Router4(config)# interface GigabitEthernet0/0
Router4(config-if)# ip ospf authentication message-digest
Router4(config-if)# ip ospf message-digest-key 1 md5 ad
Router4(config-if)# exit

Router4(config)# end
Router4# write memory
```


#### 4.7.2.2 OSPF 协议配置==验证==
- 在Router1上，查看邻居状态
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604194958.png">

- 在Router1上，查看OSPF 路由表
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604195028.png">

- 测试互通，如，从 PC5（220.1.6.2）ping 220.1.2.0/24或220.1.3.0/24 网络的路由器接口
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604195213.png">

 ---
### 4.8网络地址转换的配置
#### 4.8.1.1 为2台服务器配置静态 NAT
- 在 NAT Router 上标记“内/外”接口
```
!—— Gig0/0 连接内网 MSW4(VLAN 70) ——!
NAT-Router(config)# interface GigabitEthernet0/0
NAT-Router(config-if)# ip nat inside
NAT-Router(config-if)# exit

!—— Gig0/1 连接公网（220.1.1.0/24） ——!
NAT-Router(config)# interface GigabitEthernet0/1
NAT-Router(config-if)# ip nat outside
NAT-Router(config-if)# exit
```

- 在 NAT Router 上配置静态 NAT
```
!—— 配置静态 NAT ——!
!—— 把 192.168.40.1 映射到 220.1.1.3 ——!
NAT-Router(config)# ip nat inside source static 192.168.40.1 220.1.1.3

!—— 把 192.168.40.2 映射到 220.1.1.4 ——!
NAT-Router(config)# ip nat inside source static 192.168.40.2 220.1.1.4
```

#### 4.8.1.2 配置静态 NAT==验证==
- 在 NAT Router 上，查看NAT映射表
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604202311.png">

- 在 PC5上，从外网 ping 2台服务器
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604201715.png">
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604202014.png">

 ---
#### 4.8.2.1为公司配置 PAT
- 定义访问控制列表ACL
	- `192.168.0.0 0.0.255.255` 刚好包含了上文中 VLAN 10/20/30/40/50/60（即 192.168.10.0/24、192.168.20.0/24、192.168.30.0/26、192.168.40.0/28、192.168.50.0/24、192.168.60.0/25 等）所有内部网段。
```
NAT-Router(config)# access-list 1 permit 192.168.0.0 0.0.255.255
```

- 配置 PAT（端口地址转换）
	- 将上面的ACL 1，映射到NAT Router 的 **GigabitEthernet0/1**（外网侧地址 220.1.1.1）
```
NAT-Router(config)# ip nat inside source list 1 interface GigabitEthernet0/1 overload
```

#### 4.8.2.2 PAT ==验证==
- 查看 NAT 翻译表
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604202718.png">

- 在销售部PC ping PC5，从内网主机==**验证**==外网连通性
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604203120.png">

 ---
### 4.9网络安全技术配置
#### 4.9.1只允许2台服务器通过SW4
- 获取2台服务器的 MAC 地址
	- DNS服务器的MAC地址：0006.2A65.D762
	- WWW服务器的MAC地址：0001.43C1.298E
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604210538.png" width="450">
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604210610.png" width="450">

- 配置 Fa0/2（DNS Server）端口安全
```
!—— 进入 Fa0/2 接口
SW4(config)# interface fastEthernet0/2

!—— 启用端口安全
SW4(config-if)# switchport port-security

!—— 限制该口最多允许 1 个 MAC
SW4(config-if)# switchport port-security maximum 1

!—— 指定允许的唯一 MAC 地址为 DNS 服务器的 MAC
SW4(config-if)# switchport port-security mac-address 0006.2A65.D762

!—— 违规（其他 MAC 进入）时直接错误禁用
SW4(config-if)# switchport port-security violation shutdown

!—— 打开端口安全
SW4(config-if)# switchport port-security

SW4(config-if)# no shutdown
```

- 配置 Fa0/3（WWW Server）端口安全
```
!—— 进入 Fa0/3 接口
SW4(config)# interface fastEthernet0/3

!—— 启用端口安全
SW4(config-if)# switchport port-security

!—— 限制该口最多允许 1 个 MAC
SW4(config-if)# switchport port-security maximum 1

!—— 指定允许的唯一 MAC 地址为 WWW 服务器的 MAC
SW4(config-if)# switchport port-security mac-address 0001.43C1.298E

!—— 违规（其他 MAC 进入）时直接错误禁用
SW4(config-if)# switchport port-security violation shutdown

!—— 确保端口安全生效
SW4(config-if)# switchport port-security

SW4(config-if)# no shutdown
```

- 配置==**验证**==，查看SW4的fa0/2、fa0/3端口的安全状态
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604211252.png" width="400">

 ---
#### 4.9.2.1配置ACL【其他部门不能访问行政部】
- **分析**：凡是来源于“销售部（192.168.10.0/24）”、“技术部（192.168.20.0/24）”、“访客 Wi-Fi（192.168.50.0/24）”、“分部（192.168.60.0/25）”，所有非“行政部”子网的流量，一旦目的地为“行政部”网段 192.168.30.0/26，都应被拒绝；其他流量正常放行。

- **选择在MSW4设置ACL**：
	- ==二层交换机 SW3== 只能看到“MAC 层/二层”的信息，不会根据目的 IP 子网对不同 VLAN 之间的流量进行转发。
	- ==三层交换机 MSW4==能够根据目的 IP 子网对不同 VLAN 之间的流量进行转发。
- **思路**：在 MSW4 的 SVI `interface vlan 30` 的 in 方向绑定一个扩展 ACL。
	- **deny** 来自 192.168.10.0/24 到 192.168.30.0/26 的 IP 报文
	- **deny** 来自 192.168.20.0/24 到 192.168.30.0/26 的 IP 报文
	- **deny** 来自 192.168.50.0/24 到 192.168.30.0/26 的 IP 报文
	- **deny** 来自 192.168.60.0/25 到 192.168.30.0/26 的 IP 报文
	- **permit** 其余所有 IP 报文
```
MSW4(config)# ip access-list extended 101

!—— 允许来自任意地址到 192.168.30.1 的 ICMP 回显应答
MSW4(config-ext-nacl)# permit icmp any host 192.168.30.1 echo-reply

MSW4(config-ext-nacl)# deny   ip 192.168.10.0 0.0.0.255 host 192.168.30.1
MSW4(config-ext-nacl)# deny   ip 192.168.20.0 0.0.0.255 host 192.168.30.1
MSW4(config-ext-nacl)# deny   ip 192.168.50.0 0.0.0.255 host 192.168.30.1
MSW4(config-ext-nacl)# deny   ip 192.168.60.0 0.0.0.127 host 192.168.30.1
MSW4(config-ext-nacl)# permit ip any any
MSW4(config-ext-nacl)# exit

MSW4(config)# interface Vlan30
MSW4(config-if)# ip access-group 101 out
```

- **==验证==**：在销售部PC、行政部PC互相 ping 
	- 销售部PC，ping 192.168.30.1
	  <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604220023.png" width="450">
	- 行政部PC，ping 192.168.10.1
	  <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604220052.png" width="450">

 ---
#### 4.9.2.2配置ACL【只允许技术部使用 Telnet 登录MSW4】
- **分析**：在核心层设备上，需要限制只有技术部（IP 段 192.168.20.0/24）的用户才可以通过 Telnet（TCP 23）访问管理接口；其他部门（如销售部 192.168.10.0/24、行政部 192.168.30.0/26、访客 Wi-Fi 192.168.50.0/24、分部 192.168.60.0/25 等）的来源 IP，都应在 VTY 登录阶段被拒绝，无法建立 TCP 23 连接。

- **思路**：在 MSW4 上先创建一个标准访问控制列表（ACL），编号如 1。
    - **permit** 192.168.20.0 0.0.0.255
    - **deny** any
    - 将该 ACL 应用到 VTY 线路（line vty 0–4、5–15）的“in”方向，借助 `access-class 1 in`，这样只有来源 IP 属于技术部子网的流量能够进入 VTY，其它 IP 会被直接丢弃。
```
!-- 创建一个编号为 10 的标准 ACL，用于限制仅允许指定网段登录
MSW4(config)# ip access-list standard 10

!-- 允许来源 IP 为 192.168.20.0/24 的主机（技术部）登录
MSW4(config-std-nacl)# permit 192.168.20.0 0.0.0.255

!-- 拒绝所有其他来源 IP
MSW4(config-std-nacl)# deny   any


!-- 进入 VTY 0–15 线路视图
MSW4(config)# line vty 0 15
!-- 确保密码按要求
MSW4(config-line)# password vty111
!-- 确保启用 “login” 模式，让设备在用户连接时提示输入密码
MSW4(config-line)# login

!-- 将 ACL 10 应用于进入方向，只有满足 ACL 的 IP（即技术部子网）才能通过 Telnet 登录
MSW4(config-line)# access-class 10 in

```

- **==验证==**：在销售部PC、技术部PC telnet `192.168.30.62`
  【 MSW4 在 VLAN30（或管理网段）上的 IP 地址】
	- 销售部PC， telnet `192.168.30.62`
	  <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605104850.png">
	- 技术部PC， telnet `192.168.30.62`
	  <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605104914.png">

 ---
#### 4.9.2.3配置ACL【除了WWW服务，外网不能访问内网其他服务/主机】
- **分析**： 从外网（220.1.x.x）来看，只能访问公司内部的 WWW 服务器（HTTP/TCP 80），对其它任何端口或主机（包括 DNS、FTP、SSH、Ping 等）都应一律拒绝；同时保证公司内部访问外网和其他服务正常不受影响。
    
- **思路**：在 MSW4 上创建一个编号为 102 的扩展 ACL。
	- **permit** TCP 任意来源 到达 `<WWW_Server_IP>` 端口 80 的报文
	- **deny** 任意 IP 报文（将除 HTTP 以外的所有访问全部丢弃）
	- 将 ACL 102 应用到与外网相连的接口（`interface Vlan70`）的入方向（in）。
        - 当外网主机发起到内部的任何 IP 访问时，先经过 ACL 102 过滤；
        - 只有目标是 WWW 服务器且端口为 80 的 TCP 流量被放行，其它全部被拒绝。
	- 这样既能对外提供 WWW 服务，又能确保外网无法访问内部的 DNS、FTP、Ping 或其它任何主机及服务。
```
MSW4(config)# ip access-list extended 102

MSW4(config-ext-nacl)# permit tcp any host 192.168.40.2 eq 80
MSW4(config-ext-nacl)# deny   ip any any

!-- 切换到与外网 220.1.x.x 相连的那个接口
MSW4(config)# interface Vlan70

!-- 把 ACL 102 应用于 in 方向，所有从外网 (220.1.x.x) 来的流量都会先经过 ACL 102 过滤
MSW4(config-if)# ip access-group 102 in
```


- **==验证==**
	- 在外网主机 PC5，访问WWW服务器的公网IP（220.1.1.4）
	 <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605111100.png"> <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605110915.png">
	- 在外网主机 PC5，访问DNS服务器的公网IP（220.1.1.3），向 220.1.1.3 发起 UDP/TCP 53 端口的 DNS 查询，请求解析 “cisco.com”。
	  <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605111647.png">
	- 在外网主机 PC5，访问销售部PC（192.168.10.1）
	  <img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605111610.png">

 ---
### 4.10广域网的配置
#### 4.10.1 PPP+CHAP配置
- 串行链路配置 PPP 协议的配置
在《4.3.1.3外网各路由器端口配置》已经完成

- Router1 上的配置
```
!—— 为与 Router2 做 CHAP，用户名用 Router2，密码 soft ——!
Router1(config)# username Router2 password soft

!—— 为与 Router3 做 CHAP，用户名用 Router3，密码 soft ——!
Router1(config)# username Router3 password soft

!—— 配置 Serial0/3/0（连向 Router2）的 PPP+CHAP ——!
Router1(config)# interface Serial0/3/0
Router1(config-if)# ip address 220.1.2.1 255.255.255.0      ! 再次确认 IP
Router1(config-if)# encapsulation ppp                    ! 再次确认启用 PPP
Router1(config-if)# ppp authentication chap               ! 使用 CHAP 验证
Router1(config-if)# no shutdown
Router1(config-if)# exit

!—— 配置 Serial0/3/1（连向 Router3）的 PPP+CHAP ——!
Router1(config)# interface Serial0/3/1
Router1(config-if)# ip address 220.1.3.1 255.255.255.0      ! 已经配置好的 IP
Router1(config-if)# encapsulation ppp                    ! 启用 PPP
Router1(config-if)# ppp authentication chap               ! 使用 CHAP 验证
Router1(config-if)# no shutdown
Router1(config-if)# exit
```

- Router2 上的配置
```
!—— 为与 Router1 做 CHAP ——!
Router2(config)# username Router1 password soft

!—— 为与 Router4 做 CHAP ——!
Router2(config)# username Router4 password soft

!—— 配置 Serial0/3/0（连向 Router1）的 PPP+CHAP ——!
Router2(config)# interface Serial0/3/0
Router2(config-if)# ip address 220.1.2.2 255.255.255.0      ! 再次确认 IP
Router2(config-if)# encapsulation ppp                    ! 再次确认启用 PPP
Router2(config-if)# ppp authentication chap               ! 使用 CHAP 验证
Router2(config-if)# no shutdown
Router2(config-if)# exit

!—— 配置 Serial0/3/1（连向 Router4）的 PPP+CHAP ——!
Router2(config)# interface Serial0/3/1
Router2(config-if)# ip address 220.1.4.1 255.255.255.0      ! 再次确认 IP
Router2(config-if)# encapsulation ppp                    ! 再次确认启用 PPP
Router2(config-if)# ppp authentication chap               ! 使用 CHAP 验证
Router2(config-if)# no shutdown
Router2(config-if)# exit
```

- Router3 上的配置
```
!—— 为与 Router1 做 CHAP ——!
Router3(config)# username Router1 password soft

!—— 为与 Router4 做 CHAP ——!
Router3(config)# username Router4 password soft

!—— 配置 Serial0/3/0（连向 Router1）的 PPP+CHAP ——!
Router3(config)# interface Serial0/3/0
Router3(config-if)# ip address 220.1.3.2 255.255.255.0      ! 再次确认 IP
Router3(config-if)# encapsulation ppp                    ! 再次确认启用 PPP
Router3(config-if)# ppp authentication chap               ! 使用 CHAP 验证
Router3(config-if)# no shutdown
Router3(config-if)# exit

!—— 配置 Serial0/3/1（连向 Router4）的 PPP+CHAP ——!
Router3(config)# interface Serial0/3/1
Router3(config-if)# ip address 220.1.5.1 255.255.255.0      ! 再次确认 IP
Router3(config-if)# encapsulation ppp                    ! 再次确认启用 PPP
Router3(config-if)# ppp authentication chap               ! 使用 CHAP 验证
Router3(config-if)# no shutdown
Router3(config-if)# exit
```

- Router4 上的配置
```
!—— 为与 Router2 做 CHAP ——!
Router4(config)# username Router2 password soft

!—— 为与 Router3 做 CHAP ——!
Router4(config)# username Router3 password soft

!—— 配置 Serial0/3/0（连向 Router2）的 PPP+CHAP ——!
Router4(config)# interface Serial0/3/0
Router4(config-if)# ip address 220.1.4.2 255.255.255.0      ! 再次确认 IP
Router4(config-if)# encapsulation ppp                    ! 再次确认启用 PPP
Router4(config-if)# ppp authentication chap               ! 使用 CHAP 验证
Router4(config-if)# no shutdown
Router4(config-if)# exit

!—— 配置 Serial0/3/1（连向 Router3）的 PPP+CHAP ——!
Router4(config)# interface Serial0/3/1
Router4(config-if)# ip address 220.1.5.2 255.255.255.0      ! 再次确认 IP
Router4(config-if)# encapsulation ppp                    ! 再次确认启用 PPP
Router4(config-if)# ppp authentication chap               ! 使用 CHAP 验证
Router4(config-if)# no shutdown
Router4(config-if)# exit
```

#### 4.10.2 PPP+CHAP的==验证==
- 在Router1上，查看接口状态
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604204606.png">

- 在Router1的Serial0/3/0端口上，查看PPP 链路和 CHAP 验证状态
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604204652.png" width="475">

- 在Router1的Serial0/3/0端口上，ping Router2接口s0/3/0 或 Router3接口s0/3/0，都能 ping 通
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250604204809.png" width="500">

 ---
## 5.实验总结与心得体会
- 这个大作业涉及到了本学期几乎所有实验课学过的内容，从最开始的交换机重命名，设备的连线选用，到VLAN配置，到静态路由配置，到路由协议OSPF配置，到NAT/PAT转换配置，最后到访问控制列表配置。我重新复习了每个实验才把知识串起来，完成各个任务。
- 大作业还涉及到了很多课堂没讲的内容，如DCE/DTE串口线的用法，无线路由器的配置，DHCP服务的配置，DNS服务器解析域名的原理，三层二层交换机的区别，PPP协议和CHAP认证的配置。我大量查阅了CSDN等论坛，豆包、chatgpt等AI，并才搞清楚怎么画图、配置。

- 熟练掌握各种命令的缩写，可以极大提高效率（因为有很多重复配置）
- 每配置好一个任务一定要验证，要熟悉验证的命令，和验证信息的阅读理解
- 重要的事情说三遍：一定要多备份！一定要多备份！一定要多备份！
  由于前期备份做到不够细，导致五月下训第一次尝试时做到任务5，发现前面的验证被破坏了，找不出来哪里出问题，只能全部推翻重来，破防了QWQ
<img src="https://raw.githubusercontent.com/wcjjzz/Computer-Networks/main/attachments/Pasted%20image%2020250605114832.png">

- 为了使得文档编写方便，我使用markdown编写（方便设置表格、图片插入、代码块、高亮、加粗、分割线），再转PDF
- 为了使得文档清楚整洁美观，
	- 使用了插件自动化生成目录
	- 使用了`show run`命令，得到配置过的命令后，输入到AI，生成注释，方便每步检查

